templateXML/invioElettoriReferendum.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elet="http://it.mininterno.sie/elettorale">
    <soapenv:Header/>
    <soapenv:Body>
    <elet:DatiInvioElettori>
        <elet:Utente>
        <elet:UserID>{{UserID}}</elet:UserID>
        <elet:Password>{{Password}}</elet:Password>
    </elet:Utente> 
    <elet:Evento>
        <elet:TipoElezione>{{TipoElezione}}</elet:TipoElezione>
        <elet:DataElezione>{{DataElezione}}</elet:DataElezione>
    </elet:Evento>
    <elet:InfoElettori>
            <elet:Elettori> 
               <elet:CodiceProvincia>{{CodiceProvincia}}</elet:CodiceProvincia>
               <elet:CodiceComune>{{CodiceComune}}</elet:CodiceComune>
               <elet:LivelloAcquisizione>{{LivelloAcquisizione}}</elet:LivelloAcquisizione>
               <elet:CodiceSezione>{{CodiceSezione}}</elet:CodiceSezione>
               <elet:NumeroProgressivoArea>{{NumeroProgressivoArea}}</elet:NumeroProgressivoArea>
               <elet:DataOraInizioComunicazione>{{DataOraInizioComunicazione}}</elet:DataOraInizioComunicazione>
               <elet:DatiElettori>
                  <elet:TipoElettoreInviato>
                     <elet:NumeroTotale>{{NumeroTotale}}</elet:NumeroTotale>
                     <elet:NumeroMaschi>{{NumeroMaschi}}</elet:NumeroMaschi>
                     <elet:NumeroFemmine>{{NumeroFemmine}}</elet:NumeroFemmine>
                     <elet:CodTipoElettore>{{CodTipoElettore}}</elet:CodTipoElettore> 
                  </elet:TipoElettoreInviato>
                 <elet:TipoElettoreInviato>
                     <elet:NumeroTotale>0</elet:NumeroTotale>
                     <elet:NumeroMaschi>0</elet:NumeroMaschi>
                     <elet:NumeroFemmine>0</elet:NumeroFemmine>
                     <elet:CodTipoElettore>2</elet:CodTipoElettore> 
                  </elet:TipoElettoreInviato>
               </elet:DatiElettori>
               <elet:NumeroTotaleElettori>{{NumeroTotaleElettori}}</elet:NumeroTotaleElettori> 
               <elet:NumeroTotaleMaschi>{{NumeroTotaleMaschi}}</elet:NumeroTotaleMaschi>
               <elet:NumeroTotaleFemmine>{{NumeroTotaleFemmine}}</elet:NumeroTotaleFemmine>
            </elet:Elettori>
         </elet:InfoElettori>
      </elet:DatiInvioElettori>
   </soapenv:Body>
</soapenv:Envelope>